longcnn/Watch-NRF52840/src/displayapp/screens/ScreenDisplay.cpp
        bleIcon =  lv_img_create(lv_scr_act(), NULL);
        lv_img_set_src(bleIcon, &bluetooth);        

        logo = lv_label_create(lv_scr_act(), NULL);
        lv_obj_set_style_local_text_font(logo, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
        lv_label_set_text(logo, "OEM Name 15.2");
        //lv_label_set_text(logo, "Zien Solutions"); 
        //lv_label_set_text(logo,"FastAlert Demo3");
        lv_obj_align(logo, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 5); 

        lv_obj_align(batteryIcon, lv_scr_act(), LV_ALIGN_IN_TOP_RIGHT, -5, 5);
        lv_obj_align(bleIcon, batteryIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);
        lv_obj_align(batteryPlug, bleIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0); 

        switch (mode){
        case Modes::Clock:
          batteryController.setGoToSleep(true);
          // label_time = lv_label_create(lv_scr_act(), NULL);
          // lv_label_set_text(label_time, "");                   
          // lv_obj_set_style_local_text_font(label_time, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_30);
          // lv_obj_align(label_time, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 30);
          
          // label_date = lv_label_create(lv_scr_act(), NULL);
          // lv_label_set_text(label_date,"");
          // lv_obj_set_style_local_text_font( label_date, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          // lv_obj_align(label_date, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 65);

          buttonBig =  lv_icon_create(lv_scr_act(), &helpButton);      
          //lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,30);
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,12);
          
          /*
          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -18); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 
          
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
          */
          

          // buttonSmall =  lv_icon_create(lv_scr_act(), &Okbutton);  
          // lv_obj_align(buttonSmall, NULL, LV_ALIGN_IN_TOP_RIGHT, 0, 27); // PHAI LEN


          /*
          lableleftCircleSmall =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircleSmall, &leftCircleSmall);
          lv_obj_align(lableleftCircleSmall,NULL, LV_ALIGN_IN_TOP_RIGHT, -60, 35); 

          labletopCircleSmall =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircleSmall, &topCircleSmall);
          lv_obj_align(labletopCircleSmall,NULL, LV_ALIGN_IN_TOP_RIGHT, -10, 30); 

          lablerightCircleSmall =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircleSmall, &rightCircleSmall);
          lv_obj_align(lablerightCircleSmall,NULL, LV_ALIGN_IN_TOP_RIGHT, -5, 35); 

          lablebottomCircleSmall =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablebottomCircleSmall, &bottomCircleSmall);
          lv_obj_align(lablebottomCircleSmall,NULL, LV_ALIGN_IN_TOP_RIGHT, -12, 88); 
          */
          // labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          // lv_img_set_src(labelpoint, &pointclock);
          // lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, -5);
          
          break;
        case Modes::Test:
          batteryController.setGoToSleep(true);
          buttonBig =  lv_icon_create(lv_scr_act(), &TestButton);  
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,12);
          /*
          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -19); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 

          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
          */
          // labelpoint  = lv_img_create(lv_scr_act(), NULL);
          // lv_img_set_src(labelpoint, &pointtest);
          // lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, -5); 
          batteryController.setGoToSleep(true);
          timeoutCountStart = xTaskGetTickCount();
          //app->SetTouchMode(DisplayApp::TouchModes::Polling);

          break;  
        case Modes::CheckIn:

          buttonBig =  lv_icon_create(lv_scr_act(), &Checkin); 
          timeoutCountStart = xTaskGetTickCount(); 
          batteryController.setisButtonPushed(false);
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,30);
          
          /*
          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -19); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 

