longcnn/Watch-NRF52840/src/displayapp/screens/ScreenDisplay.cpp
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
          */
          // buttonSmall =  lv_icon_create(lv_scr_act(), &close);  
          // lv_obj_align(buttonSmall, NULL, LV_ALIGN_IN_TOP_RIGHT, 0, 27);

          buttonSmall =  lv_icon_create(lv_scr_act(), &helpSmall);  
          lv_obj_align(buttonSmall, NULL, LV_ALIGN_IN_TOP_RIGHT, 0, 27);

          break;
        case Modes::Impact:
          buttonBig =  lv_icon_create(lv_scr_act(), &impact);  
          timeoutCountStart = xTaskGetTickCount();
          batteryController.setisButtonPushed(false); 
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,30);
          /*
          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -18); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 

          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
          */
          buttonSmall =  lv_icon_create(lv_scr_act(), &Okbutton); 
          lv_obj_align(buttonSmall, NULL, LV_ALIGN_IN_TOP_RIGHT, 0, 27);
          
          /*x = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(x, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          lv_label_set_text(x, "0"); 
          lv_obj_align(x, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 30); 
          y = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(y, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          lv_label_set_text(y, "0"); 
          lv_obj_align(y, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 60); 
          z = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(z, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          lv_label_set_text(z, "0"); 
          lv_obj_align(z, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 90); 

          Xmax = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(Xmax, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          lv_label_set_text(Xmax, "0"); 
          lv_obj_align(Xmax, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 140); 
          Ymax = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(Ymax, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          lv_label_set_text(Ymax, "0"); 
          lv_obj_align(Ymax, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0,170 ); 
          Zmax = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(Zmax, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          lv_label_set_text(Zmax, "0"); 
          lv_obj_align(Zmax, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 200); 

          gwatch = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(gwatch, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          lv_label_set_text(gwatch, "0"); 
          lv_obj_align(gwatch, lv_scr_act(), LV_ALIGN_IN_RIGHT_MID, -45, 0);
          */

          break;
        case Modes::Fall:
          buttonBig =  lv_icon_create(lv_scr_act(), &Fall);  
          timeoutCountStart = xTaskGetTickCount();
          batteryController.setisButtonPushed(false); 
          lv_obj_align(buttonBig, NULL, LV_ALIGN_CENTER, 0,30);
          /*
          lableleftCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lableleftCircle, &leftCircle);
          lv_obj_align(lableleftCircle, lv_scr_act(), LV_ALIGN_CENTER, -58, 34); 

          labletopCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(labletopCircle, &topCircle);
          lv_obj_align(labletopCircle, lv_scr_act(), LV_ALIGN_CENTER, 0, -19); 

          lablerightCircle =lv_img_create(lv_scr_act(), NULL);
          lv_img_set_src(lablerightCircle, &rightCircle);
          lv_obj_align(lablerightCircle, lv_scr_act(), LV_ALIGN_CENTER, 57, 34); 

          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
            */
          buttonSmall =  lv_icon_create(lv_scr_act(), &Okbutton);          
          lv_obj_align(buttonSmall, NULL, LV_ALIGN_IN_TOP_RIGHT, 0, 27);
          
          /*
          x = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(x, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_label_set_text(x, "0"); 
          lv_obj_align(x, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 30); 
          y = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(y, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_label_set_text(y, "0"); 
          lv_obj_align(y, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 60); 
          z = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(z, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_label_set_text(z, "0"); 
          lv_obj_align(z, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 90); 

          Xmax = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(Xmax, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_label_set_text(Xmax, "0"); 
          lv_obj_align(Xmax, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 140); 
          Ymax = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(Ymax, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_label_set_text(Ymax, "0"); 
          lv_obj_align(Ymax, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0,170 ); 
          Zmax = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(Zmax, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_label_set_text(Zmax, "0"); 
          lv_obj_align(Zmax, lv_scr_act(), LV_ALIGN_IN_TOP_LEFT, 0, 200); 

