longcnn/Watch-NRF52840/src/displayapp/screens/ScreenDisplay.cpp
          gwatch = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(gwatch, LV_LABEL_STYLE_MAIN, LabelSanStyle);
          lv_label_set_text(gwatch, "0"); 
          lv_obj_align(gwatch, lv_scr_act(), LV_ALIGN_IN_RIGHT_MID, -45, 0); 
          */
          break;
        case Modes::Sensor: 
          imgSensor = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(imgSensor, &sensor);
          lv_obj_align(imgSensor, NULL, LV_ALIGN_CENTER, -40, -10); 

          heartbeatValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(heartbeatValue, true);
          lv_label_set_text(heartbeatValue, "--");
          lv_obj_set_style_local_text_font(heartbeatValue, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_40);         
          lv_obj_align(heartbeatValue, lv_scr_act(), LV_ALIGN_CENTER, 60, -25); 

          lablebpm  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(lablebpm, &bpm);
          lv_obj_align(lablebpm, NULL, LV_ALIGN_CENTER, 61, 15);   

          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointsensor);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, -5); 

          heartRateSensor.HrInit();

          textline1 = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(textline1, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_20); 
          lv_label_set_text(textline1, "Not for Medical Use"); 
          lv_obj_align(textline1, NULL, LV_ALIGN_CENTER, 0, 75); 

         /* textline2 = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(textline2, LV_LABEL_STYLE_MAIN, LabeltextStyle);
          lv_label_set_text(textline2, "Medical Purposes"); 
          lv_obj_align(textline2, NULL, LV_ALIGN_CENTER, 0, 85); 
          */
         
          break;  
        case Modes::PairDis:  
          batteryController.setGoToSleep(true);  
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &pairdis);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, 10);  
          break;
        case Modes::Charging:
          batteryController.setGoToSleep(true);  
          arcCharging = lv_arc_create(lv_scr_act(), NULL);  
          // make a circle gray color
          lv_arc_set_bg_start_angle(arcCharging, 0);
          lv_arc_set_bg_end_angle(arcCharging, 360);           
          lv_arc_set_rotation(arcCharging, 270); // rotate origin
          lv_arc_set_start_angle(arcCharging, 0);
          lv_obj_set_size(arcCharging, 160, 160);
          lv_obj_align(arcCharging, NULL, LV_ALIGN_CENTER, 0, 10);
          timeoutCountStart = xTaskGetTickCount(); 
          /* Make label */
          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(tempCValue, ""); 
          lv_obj_set_style_local_text_font(tempCValue, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_30); 
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, -35, 40);

          /*lablepercent = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(lablepercent, "%");
          lv_obj_set_style_local_text_font(lablepercent, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_30);  
          lv_obj_align(lablepercent, lv_scr_act(), LV_ALIGN_CENTER, 25, 40); 
          */

          tempWire = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(tempWire, "Wireless"); 
          lv_obj_set_style_local_text_font(tempWire, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22); 
          lv_obj_align( tempWire,lv_scr_act(), LV_ALIGN_CENTER, -2, -17);

          tempChar = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(tempChar, "Charging"); 
          lv_obj_set_style_local_text_font(tempChar, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22); 
          lv_obj_align( tempChar,lv_scr_act(), LV_ALIGN_CENTER, -2, 5);

          break;
        case Modes::LowBattery:         
          batteryController.setGoToSleep(true);  
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &lowbattery);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, 10); 
          timeoutCountStart = xTaskGetTickCount();
          /*
          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_style_local_text_font(tempCValue, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, -20, 40);
          */
          break;

        case Modes::Oxi:
         
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &oxi);
          lv_obj_align(imgpair, NULL, LV_ALIGN_CENTER, -40, -10); 

          heartbeatValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(heartbeatValue, "--");
          lv_obj_set_style_local_text_font(heartbeatValue, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_40);  
          lv_obj_align(heartbeatValue, lv_scr_act(), LV_ALIGN_CENTER, 60, -25); 
          lv_obj_set_auto_realign(heartbeatValue, true);
          
          lablepercent = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(lablepercent, "");
          lv_obj_set_style_local_text_font(lablepercent, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_30);  
          lv_obj_align(lablepercent, lv_scr_act(), LV_ALIGN_CENTER, 85, -25); 

          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointoxi);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, -5); 

          lablebpm  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(lablebpm, &spo2);
          lv_obj_align(lablebpm, NULL, LV_ALIGN_CENTER, 61, 15); 

          textline1 = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(textline1, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_20);  
          lv_label_set_text(textline1, "Not for Medical Use"); 
          lv_obj_align(textline1, NULL, LV_ALIGN_CENTER, 0, 75); 

          /*textline2 = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(textline2, LV_LABEL_STYLE_MAIN, LabeltextStyle);
          lv_label_set_text(textline2, "Medical Purposes"); 
          lv_obj_align(textline2, NULL, LV_ALIGN_CENTER, 0, 85); 
          */
          heartRateSensor.SpO2Init();  

          break;
        case Modes::Temp:
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &temp);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, -40, -10); 

          /*tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(tempCValue, true);
          lv_label_set_text(tempCValue, "--");
          lv_label_set_style( tempCValue,LV_LABEL_STYLE_MAIN,&labelStyle);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, 50, 33);
          */

