longcnn/Watch-NRF52840/src/displayapp/screens/ScreenDisplay.cpp
          tempFValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(tempFValue, true);
          lv_label_set_text(tempFValue, "--");
          lv_obj_set_style_local_text_font(tempFValue, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_40);  
          lv_obj_align(tempFValue,lv_scr_act(), LV_ALIGN_CENTER, 60, -25);


          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointtemp);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, -5); 

          lableftemp  = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(lableftemp , &ftemp);
          lv_obj_align(lableftemp , nullptr, LV_ALIGN_CENTER, 61, 15);


         /* lablectemp  = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(lablectemp , &ctemp);
          lv_obj_align(lablectemp , nullptr, LV_ALIGN_CENTER, 50, 50);
          */

          heartRateSensor.HrInit();

          timeoutCountStart = xTaskGetTickCount();
          rawTemp=35.5f + (rand()% 3)/10.0f ;

          textline1 = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(textline1, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_20); 
          lv_label_set_text(textline1, "Not for Medical Use"); 
          lv_obj_align(textline1, NULL, LV_ALIGN_CENTER, 0, 65); 

          textline2 = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(textline2, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_18); 
          lv_label_set_text(textline2, "Wrist Temperature is Lower than Forehead"); 
          lv_obj_align(textline2, NULL, LV_ALIGN_CENTER, 0, 85); 
          
          break;
        default:
          break;
    }
        //if((mode!=Modes::Clock)&&(mode!=Modes::Test)&&(mode!=Modes::Impact)&&(mode!=Modes::Fall)&&(mode!=Modes::CheckIn))
        app->SetTouchMode(DisplayApp::TouchModes::Polling); 

        if((mode==Modes::Clock)||(mode==Modes::Test)||(mode==Modes::Impact)||(mode==Modes::Fall)||(mode==Modes::CheckIn)){
          loader = lv_arc_create(lv_scr_act(), nullptr);
          lv_obj_set_style_local_line_width(loader, LV_ARC_PART_INDIC, LV_STATE_DEFAULT, LV_DPX(14));
          lv_obj_set_style_local_line_color(loader, LV_ARC_PART_INDIC, LV_STATE_DEFAULT, LV_WATCH_BLACK);
          lv_arc_set_bg_start_angle(loader, 0);
          lv_arc_set_bg_end_angle(loader, 0);
          lv_arc_set_start_angle(loader,0 );   
          //lv_arc_set_end_angle(loader, 90);  
          lv_obj_set_size(loader, 215, 215);
          lv_arc_set_rotation(loader, 90); // rotate origin     
          lv_obj_align(loader, NULL, LV_ALIGN_CENTER, 0, 12);
          lv_obj_set_hidden(loader, true);

          buttonSmallCircle = lv_arc_create(lv_scr_act(),NULL);
         // lv_obj_set_style_local_line_width(buttonSmallCircle, LV_ARC_PART_INDIC, LV_STATE_DEFAULT, LV_DPX(6));
          lv_obj_set_style_local_line_width(buttonSmallCircle, LV_ARC_PART_INDIC, LV_STATE_DEFAULT, LV_DPX(6));
          lv_obj_set_style_local_line_color(buttonSmallCircle, LV_ARC_PART_INDIC, LV_STATE_DEFAULT, LV_WATCH_BLACK);
          lv_arc_set_bg_start_angle(buttonSmallCircle, 0);
          lv_arc_set_bg_end_angle(buttonSmallCircle, 0);
          lv_arc_set_start_angle(buttonSmallCircle,0 );   
          //lv_arc_set_end_angle(buttonSmallCircle, 90);  
          lv_obj_set_size(buttonSmallCircle, 74, 74);
          lv_arc_set_rotation(buttonSmallCircle, 90); // rotate origin     
          lv_obj_align(buttonSmallCircle, NULL, LV_ALIGN_IN_TOP_RIGHT, 2, 26);
          lv_obj_set_hidden(buttonSmallCircle, true);
        }                  
 }

ScreenDisplay::~ScreenDisplay() {
  lv_obj_clean(lv_scr_act());
  //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
  batteryController.setcheckVibrate(false);
  batteryController.setisButtonPushed(false);
  heartRateSensor.Disable();
  heartrate=0; 
  checkTouchBigButton = false;
  checkTouchSmallButton = false;
  checkPolling = true;
  enableTouchBigButton= false;
  enableTouchSmallButton = false;
  //tempSensor.stop();
}

bool ScreenDisplay::Refresh() {
    auto month =dateTimeController.Month();
    auto day = dateTimeController.Day();
    auto dayOfWeek = dateTimeController.DayOfWeek();
    auto hour =  dateTimeController.Hours();  
    auto minute =  dateTimeController.Minutes();  
    char timeStr[5];

    if (clockType == ClockType::H12) {
      if (hour == 0 && hour != 12) {
        hour = 12; 
      } else if (hour == 12 && hour != 0) {
        hour = 12; 
      } else if (hour < 12 && hour != 0) {

      } else if (hour > 12 && hour != 0) {
        hour = hour - 12; 
      }
    }

/*
    if((mode!=Modes::Clock)&&(mode!=Modes::Test)&&(mode!=Modes::Impact)&&(mode!=Modes::Fall)&&(mode!=Modes::CheckIn)) {                 
        if((modPolling>200) && checkPolling) {
          app->SetTouchMode(DisplayApp::TouchModes::Gestures);
          checkPolling = false;
        } else modPolling++;
    }
*/
    sprintf(timeStr, "%02d:%02d", static_cast<int>(hour), static_cast<int>(minute));     
    if(flagbattery >30){   
       batteryPercent = batteryController.PercentRemaining();
      flagbattery =0 ;
    } else flagbattery++;

    if(!batteryController.IsCharging()) {
        if(batteryPercent<15) lv_img_set_src(batteryIcon, &battery_05);
          else if(batteryPercent<40) lv_img_set_src(batteryIcon, &battery_20);
          else if(batteryPercent<85) lv_img_set_src(batteryIcon, &battery_50);
          else lv_img_set_src(batteryIcon, &battery_100);
        } else {
        if(batteryPercent<15) lv_img_set_src(batteryIcon, &battery_05_c);
          else if(batteryPercent<40) lv_img_set_src(batteryIcon, &battery_20_c);
          else if(batteryPercent<90) lv_img_set_src(batteryIcon, &battery_50_c);
          else lv_img_set_src(batteryIcon, &battery_100_c);      
        } 
      char strBat[6];      
      sprintf (strBat, "%d%%", uint8_t(batteryPercent));
  
    /*
    if(batteryController.IsCharging())
    {
      lv_obj_set_hidden(batteryPlug,false);
    } else lv_obj_set_hidden(batteryPlug,true);
    */
    if (bleController.IsConnected()) { lv_img_set_src(bleIcon, &bluetooth);} 
    else { lv_img_set_src(bleIcon, &bluetoothdis); }  
  
