longcnn/Watch-NRF52840/src/displayapp/screens/ScreenDisplay.cpp
    lv_obj_align(batteryIcon, lv_scr_act(), LV_ALIGN_IN_TOP_RIGHT, -5, 5);
    lv_obj_align(bleIcon, batteryIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);
    lv_obj_align(batteryPlug, bleIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);

  switch (mode)  {
  case Modes::Clock: 
    char dateStr[15];
    // sprintf(dateStr, "%s, %s %d", DayOfWeekToString(dayOfWeek),MonthToString(month),day);
    // lv_label_set_text(label_date, dateStr); 
    // lv_label_set_text(label_time, timeStr);

    if((modPolling>13) && checkPolling) {
      //app->SetTouchMode(DisplayApp::TouchModes::Polling);
      enableTouchBigButton= true;
      enableTouchSmallButton = true;
      checkPolling = false;
      checkTouchBigButton =false;
    } else modPolling++;
    

    if((xTaskGetTickCount()-timeoutCountStart) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
        tempTouch++;
        lv_obj_set_hidden(loader, false);
        lv_arc_set_end_angle(loader, 360-tempTouch*45);
        if(tempTouch>5) {
          modPolling =0; checkPolling=true;
          enableTouchBigButton= false;
          //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
        }
        
      } else  {lv_obj_set_hidden(loader, true); tempTouch=0;}

    checkTouchBigButton = false;

    if((xTaskGetTickCount()-timeoutCountStartS) < 1.5*1024){checkTouchSmallButton = false;}
    if(checkTouchSmallButton) {
      tempTouchSmall++;
      lv_obj_set_hidden(buttonSmallCircle , false);
      lv_arc_set_end_angle(buttonSmallCircle , 360-tempTouchSmall*38);

      if(tempTouchSmall>6) {
        modPolling =0; checkPolling=true;
        //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
        enableTouchSmallButton = false;
      }
    } else  {lv_obj_set_hidden(buttonSmallCircle , true); tempTouchSmall=0;}

  checkTouchSmallButton = false;

    break;
  case Modes::Test:
      timeout=xTaskGetTickCount()-timeoutCountStart; 
      if((timeout>1*1024) & !checkTest) { 
      if(batteryController.PercentRemaining()<25) batteryController.sendAlerts(0x05); 
      else batteryController.sendAlerts(0x06);  
      checkTest=true;                 
    }

    if((modPolling>13)&& checkPolling) {
       //app->SetTouchMode(DisplayApp::TouchModes::Polling);
       checkPolling = false;
       enableTouchBigButton= true;
    } else modPolling++;

    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
        tempTouch++;
        lv_obj_set_hidden(loader, false);
        lv_arc_set_end_angle(loader, 360-tempTouch*45);
        if(tempTouch>5) {
          modPolling =0; checkPolling=true;
          //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
          enableTouchBigButton= false;
        }
      } else  {lv_obj_set_hidden(loader, true); tempTouch=0;}
    checkTouchBigButton = false;

    break; 

  case Modes::CheckIn:   

   if(batteryController.isTimerStart1() && (batteryController.getCheckinTime1()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute()<3)) {             
        if(batteryController.isTimerDone1()||batteryController.getisButtonPushed()) {
            batteryController.setGoToSleep(true);         
            batteryController.setcheckVibrate(false); 
            batteryController.setisTimer1Done(false);         
          } else  batteryController.setcheckVibrate(true);

         if(batteryController.getcheckVibrate()) batteryController.setIsVibrate(); 
    }
    else if( batteryController.isTimerStart1() && (batteryController.getCheckinTime1()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute() ==3)&& (batteryController.getCurrentSecond()<3)) {  
            batteryController.setButtonData(0x16); 
            batteryController.setIsAlert(0x16);       
            batteryController.setGoToSleep(true); 
            //batteryController.StopVibrate() ;       
    } 
   
  
    if(batteryController.isTimerStart2() && (batteryController.getCheckinTime2()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute() <3)) {     
        if(batteryController.isTimerDone2()||batteryController.getisButtonPushed()) {         
            batteryController.setGoToSleep(true); 
            batteryController.setcheckVibrate(false); 
            batteryController.setisTimer2Done(false);      
          } else batteryController.setcheckVibrate(true);
         if(batteryController.getcheckVibrate()) batteryController.setIsVibrate();  
    } else if( batteryController.isTimerStart2() && (batteryController.getCheckinTime2()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute()==3)&&(batteryController.getCurrentSecond()<3)) {  
            batteryController.setButtonData(0x17); 
            batteryController.setIsAlert(0x17);       
            batteryController.setGoToSleep(true); 
            //batteryController.StopVibrate();           
    } 

    if((modPolling>14)&& checkPolling) {
      //app->SetTouchMode(DisplayApp::TouchModes::Polling);
      enableTouchBigButton= true;
      enableTouchSmallButton = true;
      checkPolling = false;
    } else modPolling++;

    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
      if(checkTouchBigButton) {
        tempTouch++;
        lv_obj_set_hidden(loader, false);
        lv_arc_set_end_angle(loader, 360-tempTouch*45);
        if(tempTouch>5) {
            modPolling =0; checkPolling=true;
            enableTouchBigButton= false;
            //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
          }
        } else  {lv_obj_set_hidden(loader, true); tempTouch=0;}
      checkTouchBigButton = false;


    if((xTaskGetTickCount()-timeoutCountStartS) < 1.5*1024){checkTouchSmallButton = false;}
      if(checkTouchSmallButton) {
        tempTouchSmall++;
        lv_obj_set_hidden(buttonSmallCircle , false);
        lv_arc_set_end_angle(buttonSmallCircle , 360-tempTouchSmall*45);
        if(tempTouchSmall>5) {
          modPolling =0; checkPolling=true;
          enableTouchSmallButton = false;
          //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
        }
      } else  {lv_obj_set_hidden(buttonSmallCircle , true); tempTouchSmall=0;}
      checkTouchSmallButton = false;
    break; 
    case Modes::Impact:
    timeout=xTaskGetTickCount()-timeoutCountStart;
    if(timeout<30*1024) { 
      if((batteryController.getimpactyy()==0x04) || batteryController.getisButtonPushed()) {
        batteryController.setcheckVibrate(false);
      } else batteryController.setcheckVibrate(true);
      if(batteryController.getcheckVibrate()) batteryController.setIsVibrate(); 
    } else if((timeout<31*1024) && !batteryController.getisButtonPushed()) batteryController.setButtonData(0x13); 

      if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
   
    if((modPolling>14)&& checkPolling) {
        //app->SetTouchMode(DisplayApp::TouchModes::Polling);
        enableTouchBigButton= true;
        enableTouchSmallButton = true;
        checkPolling = false;
      } else modPolling++;

      if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
      if(checkTouchBigButton) {
          tempTouch++;
          lv_obj_set_hidden(loader, false);
          lv_arc_set_end_angle(loader, 360-tempTouch*45);
          if(tempTouch>5) {
            modPolling =0; checkPolling=true;
            enableTouchBigButton= false;
            //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
          }
        } else  {lv_obj_set_hidden(loader, true); tempTouch=0;}
      checkTouchBigButton = false;

      if((xTaskGetTickCount()-timeoutCountStartS) < 1.5*1024){checkTouchSmallButton = false;}
      if(checkTouchSmallButton) {
        tempTouchSmall++;
        lv_obj_set_hidden(buttonSmallCircle , false);
        lv_arc_set_end_angle(buttonSmallCircle , 360-tempTouchSmall*45);
       if(tempTouchSmall>5) {
        modPolling =0; checkPolling=true;
        enableTouchSmallButton = false;
        //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
      }
    } else  {lv_obj_set_hidden(buttonSmallCircle , true); tempTouchSmall=0;}

  checkTouchSmallButton = false;
    
