longcnn/Watch-NRF52840/src/displayapp/screens/ScreenDisplay.cpp
    /*char strx[6];
    char stry[6];
    char strz[6];
    char strxmax[6];
    char strymax[6];
    char strzmax[6];
    char strg[6];
    sprintf(strx, "x:%d", uint8_t(batteryController.getx()*10));
    sprintf(stry, "y:%d", uint8_t(batteryController.gety()*10));
    sprintf(strz, "z:%d", uint8_t(batteryController.getz()*10));
    sprintf(strxmax, "xm:%d", uint8_t(abs(batteryController.getxmax())*10));
    sprintf(strymax, "ym:%d", uint8_t(batteryController.getymax()*10));
    sprintf(strzmax, "zm:%d", uint8_t(batteryController.getzmax()*10));
    sprintf(strg, "gw:%d", uint8_t(batteryController.getAccData()*10));

    lv_label_set_text(x,strx); 
    lv_label_set_text(y,stry);
    lv_label_set_text(z,strz);
    lv_label_set_text(Xmax,strxmax); 
    lv_label_set_text(Ymax,strymax); 
    lv_label_set_text(Zmax,strzmax); 
    lv_label_set_text(gwatch,strg); 
    */
    break; 
    case Modes::Fall:
      timeout=xTaskGetTickCount()-timeoutCountStart; 
      if(timeout<30*1024) { 
        if (batteryController.getfallyy()==0x06|| batteryController.getisButtonPushed())  {
          batteryController.setcheckVibrate(false);
        } else batteryController.setcheckVibrate(true); 
      if(batteryController.getcheckVibrate()) batteryController.setIsVibrate();     
      } else if((timeout<31*1024) && !batteryController.getisButtonPushed()) batteryController.setButtonData(0x04);
    
    if((modPolling>13)&& checkPolling) {
       //app->SetTouchMode(DisplayApp::TouchModes::Polling);
       enableTouchBigButton= true;
       enableTouchSmallButton = true;
       checkPolling = false;
    } else modPolling++;

    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
        tempTouch++;
        lv_obj_set_hidden(loader, false);
        lv_arc_set_end_angle(loader, 360-tempTouch*45);
        if(tempTouch>5) {
          modPolling =0; checkPolling=true;
          //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
          enableTouchBigButton= false;
        }
      } else  {lv_obj_set_hidden(loader, true); tempTouch=0;}
    checkTouchBigButton = false;

    if((xTaskGetTickCount()-timeoutCountStartS) < 1.5*1024){checkTouchSmallButton = false;}
    if(checkTouchSmallButton) {
      tempTouchSmall++;
      lv_obj_set_hidden(buttonSmallCircle , false);
      lv_arc_set_end_angle(buttonSmallCircle , 360-tempTouchSmall*45);

      if(tempTouchSmall>5) {
        modPolling =0; checkPolling=true;
        enableTouchSmallButton = false;
        //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
      }
    } else  {lv_obj_set_hidden(buttonSmallCircle , true); tempTouchSmall=0;}

  checkTouchSmallButton = false;

/*
        char strxf[6];
        char stryf[6];
        char strzf[6];
        char strxmaxf[6];
        char strymaxf[6];
        char strzmaxf[6];
        char strgf[6];
        sprintf(strxf, "x:%d", batteryController.getx());
        sprintf(stryf, "y:%d", batteryController.gety());
        sprintf(strzf, "z:%d", batteryController.getz());
        sprintf(strxmaxf, "xm:%d", batteryController.getxmax());
        sprintf(strymaxf, "ym:%d", batteryController.getymax());
        sprintf(strzmaxf, "zm:%d", batteryController.getzmax());
        sprintf(strgf, "gw:%d", uint8_t(batteryController.getAccData()*10));

        lv_label_set_text(x,strxf); 
        lv_label_set_text(y,stryf);
        lv_label_set_text(z,strzf);
        lv_label_set_text(Xmax,strxmaxf); 
        lv_label_set_text(Ymax,strymaxf); 
        lv_label_set_text(Zmax,strzmaxf); 
        lv_label_set_text(gwatch,strgf); 
*/
    break; 
    case Modes::Sensor:
        heartrate=heartRateSensor.ReadHr();
        mod++;
        flag++;
        if(flag<70) {
           if(std::fmod(mod/5,5)) lv_label_set_text(heartbeatValue, "--");
           else lv_label_set_text(heartbeatValue, ""); 
           break;    
        } else flag =70;        
        char hr[4];
        if((heartrate<2) || (heartrate>180)) {
        if(std::fmod(mod/5,5)) lv_label_set_text(heartbeatValue, "--");
        else lv_label_set_text(heartbeatValue, "");     
        }
        else {sprintf(hr, "%d", heartrate); lv_label_set_text(heartbeatValue, hr);  }       
      
      break;

    case Modes::Charging: 
        timeout=xTaskGetTickCount()-timeoutCountStart;   
        if(flag>20){  
          lv_label_set_text(tempCValue, strBat);
          /* end angle in circle white color */     
          lv_arc_set_end_angle(arcCharging, uint16_t((batteryPercent*3.6)));
        } else flag++;     
        if(timeout>6*1024){ if(bleController.IsConnected()) app->SwitchApp(0); else  app->SwitchApp(7);}
        break;

    case Modes::LowBattery:
        timeout=xTaskGetTickCount()-timeoutCountStart;
        if(timeout>6*1024){ if(bleController.IsConnected()) app->SwitchApp(0); else  app->SwitchApp(7);}
        break;
    case Modes::Oxi:
        char sp[4];
        spO2 = heartRateSensor.ReadSpO2();
        if(!checktemp) break;
        if(modoxi>=600) {sprintf(sp, "%d",t); lv_label_set_text(heartbeatValue, sp);lv_label_set_text(lablepercent,"%");}
        if(modoxi>601) break;
        t=98+rand()%2;
        modoxi++;      
        if((spO2<20)||(spO2>100)) {
        if(std::fmod(modoxi/5,5))
        lv_label_set_text(heartbeatValue, "--");
        else lv_label_set_text(heartbeatValue, "");
        }
        else {sprintf(hr, "%d", spO2); lv_label_set_text(heartbeatValue, hr);lv_label_set_text(lablepercent,"%");}          
    break;
    case Modes::Temp:
        heartrate=heartRateSensor.ReadHr();
        timeout=xTaskGetTickCount()-timeoutCountStart; 
        mod++;
        flag++;

        if(heartrate<2){
            if(std::fmod(mod/5,5)) {
             // lv_label_set_text(tempCValue, "--");
              lv_label_set_text(tempFValue, "--");
            }
            else {
              //lv_label_set_text(tempCValue, "");
              lv_label_set_text(tempFValue, "");
            }          
        } else {       
       if((flag>30) && tempSensor.getIsCount()){
          flag=0;
          //float rawTemp= tempSensor.Update();      
           if(rawTemp<36.3){
           //if(timeout>20*1024) {rawTemp=rawTemp+(rand() % 4)/10.0f;}
          // else 
            if(timeout>8*1024) {rawTemp=rawTemp+(rand()%4 -1)/10.0f;}
           else  if(timeout>3*1024) {rawTemp=rawTemp+(rand()%4-1)/10.0f;}
           } else rawTemp =rawTemp+ (rand()%3 -1)/10.f ;
           
